package HomeWork10;

/*
1.  Создать массив с набором слов (10-20 слов, должны встречаться повторяющиеся). Найти и вывести список уникальных слов,
    из которых состоит массив (дубликаты не считаем). Посчитать, сколько раз встречается каждое слово.
2.  Написать простой класс Телефонный Справочник, который хранит в себе список фамилий и телефонных номеров.
    В этот телефонный справочник с помощью метода add() можно добавлять записи, а с помощью метода get() искать номер
    телефона по фамилии. Следует учесть, что под одной фамилией может быть несколько телефонов (в случае однофамильцев),
    тогда при запросе такой фамилии должны выводиться все телефоны. Желательно не добавлять лишний функционал
    (дополнительные поля (имя, отчество, адрес), взаимодействие с пользователем через консоль и т.д).
    Консоль использовать только для вывода результатов проверки телефонного справочника.
 */

// Домашнаа работа в процессе...

public class Main {
    public static void main(String[] args) {

    }

    private static final String text =
            "Повторюсь — в отраженьях зеркал," +
                    "Повторюсь — в эхе собственных мыслей." +
                    "Повторюсь — в слове, что вслух сказал," +
                    "И в стихах, став их сути частицей." +

                    "Повторюсь — в очертании тени," +
                    "Повторюсь — в деле опытом дней." +
                    "Повторюсь — в непогоде весенней," +
                    "Растворяясь, в слезинках дождей." +

                    "Повторюсь — в детство сном возвратившись," +
                    "Повторюсь — вспомнив кто я и где." +
                    "Повторюсь — в жизнь опять возродившись," +
                    "Не поддавшись, унынью в беде." +

                    "Повторюсь — в своих детях их нравом," +
                    "Тем, что сам, от родителей взял." +
                    "Повторюсь — в мире в чём-нибудь малом," +
                    "Что в него, на пути жизнью дал." +

                    "Повторюсь — повторюсь я когда-нибудь снова," +
                    "Повторюсь — ведь всё в жизни, по кругу идёт." +
                    "Повторюсь — ведь нас сОздало всех Его Слово," +
                    "И меня — повторив, эхо Слова вернёт...";

}
